#define _CRT_SECURE_NO_DEPRECATE 1
#include<stdio.h>

//  &&  逻辑与
//  ||  逻辑或


int main7()
{
	int a = 3;
	int b = 5;
	int c = a && b;      
	printf("逻辑与 两个不为零的数，结果：%d\n", c);

	a = 0;
	b = 5;
	c = a && b;
	printf("逻辑与 其中一个为0，结果：%d\n", c);

	//逻辑与(&&)：两个数有一个假（0）就是假（0）


	a = 3;
	b = 5;
	c = a || b;
	printf("逻辑或 两个不为零的数，结果：%d\n", c);

	a = 3;
	b = 5;
	c = a || b;
	printf("逻辑或 其中一个为0，结果：%d\n", c);

	a = 0;
	b = 0;
	c = a || b;
	printf("逻辑或 两个0，结果为：%d\n", c);

	//逻辑或（||）：两个数有一个为真（非零）就是真







//练习题       （360面试题）
	a = 1;
	b = 2;
	c = 3;
	int i = ++a || ++b || c++;     // && 和 || ：只要 ++a 是真（或假），就得出1或0的结论的话，那么 ++b 就不会进行运算了，直接停止运算（判断）
	                                             //有人说这叫  惰性计算                    左边能计算出来真假，右面就直接忽略
	//最后结果是   a = 2;  b = 2;  c = 3; 




	return 0;

}